Project/Toir.Adaptation/src/InformationRegisters/торо_ВнешниеОснованияДляРабот/торо_ВнешниеОснованияДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВнешниеОснованияДляРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>КритичностьДефекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="fb2fda01-f8af-4657-9434-8cc1e4174283">
    <name>ДатаНачалаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОтказавшийЭлемент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="fdadcdac-c84a-4c5e-9f9d-425c9ce8d7b8">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_АктуальныеПлановыеДатыРемонтов/торо_АктуальныеПлановыеДатыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_АктуальныеПлановыеДатыРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="87dab202-5f73-4752-a87e-e69c7a5c70e7">
    <name>КрайняяДатаЗавершения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>ДокументНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ee4238f-830b-4334-9861-1394de9ae423">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8cd050f-96b8-4025-804f-118eec0e9fd4">
    <name>гкс_ЭтоПереносРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Documents/торо_ВнешнееОснованиеДляРабот/торо_ВнешнееОснованиеДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВнешнееОснованиеДляРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ОбследованноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7c58d82d-a608-4033-a56b-11f5b496d2f1">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="13efe440-7374-4800-b6a4-495744f06814">
      <name>Описание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.торо_ВыявленныеДефекты</registerRecords>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоИнициатора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОбнаружения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДефектВыявленВПроцессе</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79fbf4a8-8f51-4cef-917b-3e00059df530">
    <name>гкс_Влияние</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e4aede75-6f77-4f7d-9149-2cd4d20b2f34">
    <name>гкс_ДефектОформленПоТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7c71a5eb-8ff5-48ba-99f5-fb9859401460">
    <name>гкс_НомерТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2fadb04b-3aaa-4dd8-b305-d053aced95ae">
    <name>гкс_СрочностьВоздействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e5d0d56b-7671-492d-a748-7b755db0a10d">
    <name>гкс_КачественнаяОценка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>СписокДефектов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДефектВыявленВПроцессе</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектПричина</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонтов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОтказавшийЭлемент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектОписание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПоследствияДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НаправлениеНаУстранение</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПодразделениеИсполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыПодбораИзМатрицыОценкиРисков</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ID_Ремонта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>РезультатВыбора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0e256218-3632-4e2f-81f1-fbae93c7e394">
    <name>гкс_ФайлыФиксации</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/CommonModules/торо_ПланированиеРемонтов/Module.bsl
#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ВычислитьАктуальныеПлановыеДатыРемонтовПоВОиВД")
Функция гкс_ВычислитьАктуальныеПлановыеДатыРемонтовПоВОиВД(МассивID)

	МенеджерВТ = Новый МенеджерВременныхТаблиц;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_ВнешниеОснованияДляРабот.Регистратор КАК ДокументНачалаЦепочки,
	|	торо_ВнешниеОснованияДляРабот.ID КАК IDРемонта,
	|	торо_ВнешниеОснованияДляРабот.ОбъектРемонта КАК ОбъектРемонта,
	#Удаление
	|	торо_ВнешниеОснованияДляРабот.ПлановаяДатаРемонта КАК ДатаОкончания
	#КонецУдаления
	#Вставка
	|	торо_ВнешниеОснованияДляРабот.ПлановаяДатаРемонта КАК ДатаНачала,
	|	торо_ВнешниеОснованияДляРабот.гкс_ДатаОкончания КАК ДатаОкончания
	#КонецВставки
	|ПОМЕСТИТЬ ВТ_ВнешниеОснования
	|ИЗ
	|	РегистрСведений.торо_ВнешниеОснованияДляРабот КАК торо_ВнешниеОснованияДляРабот
	|ГДЕ
	|	торо_ВнешниеОснованияДляРабот.Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
	|	И торо_ВнешниеОснованияДляРабот.ID В(&МассивID)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ВыявленныеДефектыСрезПоследних.Регистратор КАК ДокументНачалаЦепочки,
	|	торо_ВыявленныеДефектыСрезПоследних.ID КАК IDРемонта,
	|	торо_ВыявленныеДефектыСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ВыявленныеДефектыСрезПоследних.ДатаНачалаРемонта КАК ДатаНачала,
	|	торо_ВыявленныеДефектыСрезПоследних.ДатаОкончанияРемонта КАК ДатаОкончания,
	|	торо_ВыявленныеДефектыСрезПоследних.КрайняяДопустимаяДатаЗавершенияРемонта КАК КрайняяДатаЗавершения
	|ПОМЕСТИТЬ ВТ_Дефекты
	|ИЗ
	|	РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(, Регистратор ССЫЛКА Документ.торо_ВыявленныеДефекты) КАК торо_ВыявленныеДефектыСрезПоследних
	|ГДЕ
	|	торо_ВыявленныеДефектыСрезПоследних.ID В(&МассивID)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВнешниеОснования.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ВТ_ВнешниеОснования.IDРемонта КАК IDРемонта,
	|	ВТ_ВнешниеОснования.ОбъектРемонта КАК ОбъектРемонта,
	#Удаление
	|	ВТ_Дефекты.ДатаНачала КАК ДатаНачала,
	#КонецУдаления
	#Вставка
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Дефекты.ДатаНачала ЕСТЬ NULL
	|				И ВТ_Дефекты.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_Дефекты.ДатаНачала
	|		ИНАЧЕ ВТ_ВнешниеОснования.ДатаНачала
	|	КОНЕЦ КАК ДатаНачала,
	#КонецВставки
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Дефекты.ДатаОкончания ЕСТЬ NULL
	|				И ВТ_Дефекты.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_Дефекты.ДатаОкончания
	|		ИНАЧЕ ВТ_ВнешниеОснования.ДатаОкончания
	|	КОНЕЦ КАК ДатаОкончания,
	|	ВТ_Дефекты.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
	|	ЕСТЬNULL(ВТ_Дефекты.ДокументНачалаЦепочки, ВТ_ВнешниеОснования.ДокументНачалаЦепочки) КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ_ДатыИсходные
	|ИЗ
	|	ВТ_ВнешниеОснования КАК ВТ_ВнешниеОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Дефекты КАК ВТ_Дефекты
	|		ПО ВТ_ВнешниеОснования.IDРемонта = ВТ_Дефекты.IDРемонта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Дефекты.ДокументНачалаЦепочки,
	|	ВТ_Дефекты.IDРемонта,
	|	ВТ_Дефекты.ОбъектРемонта,
	|	ВТ_Дефекты.ДатаНачала,
	|	ВТ_Дефекты.ДатаОкончания,
	|	ВТ_Дефекты.КрайняяДатаЗавершения,
	|	ВТ_Дефекты.ДокументНачалаЦепочки
	|ИЗ
	|	ВТ_Дефекты КАК ВТ_Дефекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВнешниеОснования КАК ВТ_ВнешниеОснования
	|		ПО ВТ_Дефекты.IDРемонта = ВТ_ВнешниеОснования.IDРемонта
	|ГДЕ
	|	ВТ_ВнешниеОснования.IDРемонта ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта";

	Запрос.УстановитьПараметр("МассивID", МассивID);
	Запрос.Выполнить();

	СоздатьВременныеТаблицыПоПриоритетнымДокументамПлана(МенеджерВТ);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТ_ДатыИсходные.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ВТ_ДатыИсходные.IDРемонта КАК IDРемонта,
	|	ВТ_ДатыИсходные.ОбъектРемонта КАК ОбъектРемонта,
	|	ЕСТЬNULL(ВТ_ОстановочныеРемонты.ДатаНачала, ЕСТЬNULL(ВТ_СкользящиеПланы.ДатаНачала, ЕСТЬNULL(ВТ_Заявки.ДатаНачала, ВТ_ДатыИсходные.ДатаНачала))) КАК ДатаНачала,
	|	ЕСТЬNULL(ВТ_ОстановочныеРемонты.ДатаОкончания, ЕСТЬNULL(ВТ_СкользящиеПланы.ДатаОкончания, ЕСТЬNULL(ВТ_Заявки.ДатаОкончания, ВТ_ДатыИсходные.ДатаОкончания))) КАК ДатаОкончания,
	|	ЕСТЬNULL(ВТ_СкользящиеПланы.КрайняяДатаЗавершения, ВТ_ДатыИсходные.КрайняяДатаЗавершения) КАК КрайняяДатаЗавершения,
	|	ЕСТЬNULL(ВТ_ОстановочныеРемонты.ДокументОснование, ЕСТЬNULL(ВТ_СкользящиеПланы.ДокументОснование, ЕСТЬNULL(ВТ_Заявки.ДокументОснование, ВТ_ДатыИсходные.ДокументОснование))) КАК ДокументОснование
	|ИЗ
	|	ВТ_ДатыИсходные КАК ВТ_ДатыИсходные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заявки КАК ВТ_Заявки
	|		ПО ВТ_ДатыИсходные.IDРемонта = ВТ_Заявки.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстановочныеРемонты КАК ВТ_ОстановочныеРемонты
	|		ПО ВТ_ДатыИсходные.IDРемонта = ВТ_ОстановочныеРемонты.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СкользящиеПланы КАК ВТ_СкользящиеПланы
	|		ПО ВТ_ДатыИсходные.IDРемонта = ВТ_СкользящиеПланы.IDРемонта";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Возврат Выборка;

КонецФункции

&ИзменениеИКонтроль("торо_ОбновитьПлановыеДатыПриПроведенииОбработчик")
Процедура гкс_торо_ОбновитьПлановыеДатыПриПроведенииОбработчик(Источник)

	СтруктураДанныхРемонтов = ПолучитьМассивIDРемонтов(Источник);
	Если СтруктураДанныхРемонтов = Неопределено Тогда
		Возврат;
	КонецЕсли;;
	#Вставка
	// гкс+ [] Деснол 16.08.2022
	// заявка не должна переопределять даты ремонта если есть перенос
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.торо_ЗаявкаНаремонт") Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта КАК ИД
			|ИЗ
			|	РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
			|ГДЕ
			|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта В(&ИД)
			|	И торо_АктуальныеПлановыеДатыРемонтов.гкс_ЭтоПереносРемонта = ИСТИНА";
		Запрос.УстановитьПараметр("ИД", СтруктураДанныхРемонтов.МассивID);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда 
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтруктураДанныхРемонтов.МассивID.Удалить(СтруктураДанныхРемонтов.МассивID.Найти(Выборка.ИД));
			КонецЦикла;
		КонецЕсли;
		Если СтруктураДанныхРемонтов.МассивID.Количество() = 0 Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// гкс- [] Деснол 16.08.2022
	#КонецВставки

	МассивID = СтруктураДанныхРемонтов.МассивID;
	УстановитьУправляемыеБлокировкиНаРегистрАктуальныхДат(СтруктураДанныхРемонтов.ТаблицаРемонтов);

	// Для случая, если документ перепроводится, при этом какой-то ремонт из документа удалили, 
	// и больше никаких документов по тому ремонту не было.
	// Чтобы он не остался висеть в регистре, очистим записи.
	УдалитьПлановыеДатыРемонтовПоДокументуНачалаЦепочки(Источник.Ссылка);
	ТекущиеЗаписиРегистра = ПолучитьАктуальныеДатыРемонтов(МассивID);

	Источник.Движения.Записать();
	ОбновитьАктуальныеПлановыеДатыРемонтов(МассивID, Источник.Ссылка, ТекущиеЗаписиРегистра);

КонецПроцедуры

#КонецОбласти
